snlkuharlocal/src/AccumulationRegisters/СертификатныеОстатки/СертификатныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СертификатныеОстатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.ПодарочныеСертификаты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВидыОплаты/ВидыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОплаты</name>
  <enumValues>
    <name>НАЛ</name>
    <comment>Наличные</comment>
  </enumValues>
  <enumValues>
    <name>БН</name>
    <comment>Без нал</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ХранилищеПодарочныхСертификатов/ХранилищеПодарочныхСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ХранилищеПодарочныхСертификатов</name>
  <basedOn>Document.Инвентаризация</basedOn>
  <basedOn>Document.ОприходованиеТМЦ</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ДокОбъект</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сертификаты</name>
    <attributes>
      <name>КодСертификата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номинал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасч</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.ПодарочныеСертификаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ПодарочныеСертификаты/ПодарочныеСертификаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодарочныеСертификаты</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ПодразделениеВыдачи</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПредъявления</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Использован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <comment>Срок действия сертификата (в днях)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЭмиссияПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаПогашения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подарок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяСуммаЧекаПогашения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСертификата</name>
    <type>
      <types>CatalogRef.ВидыПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>CatalogRef.Акции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗатрат</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриниматьКРасходамНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйПроцентОтоваривания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТЦПриемки</name>
    <comment>Тц , где можно будет их отоварить</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаНеБолее30Процентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Эмитент</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОдинКупонНаЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТЦПриемки</name>
    <attributes>
      <name>ТЦ</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/CommonModules/УчетСертификатов/Module.bsl
функция СертификатныеОстаткиПоСкладу(склад,ДатаОстатков)  экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	СертификатныеОстаткиОстатки.Сертификат КАК Сертификат,
	|	СертификатныеОстаткиОстатки.КоличествоОстаток КАК Количество,
	|	СертификатныеОстаткиОстатки.СуммаОстаток КАК Всего
	|ИЗ
	|	РегистрНакопления.СертификатныеОстатки.Остатки(&Дата2, Склад = &склад) КАК СертификатныеОстаткиОстатки";
	запрос.УстановитьПараметр("Склад",склад);
	запрос.УстановитьПараметр("Дата2",ДатаОстатков);
	результат=запрос.Выполнить().Выгрузить();
	возврат результат
	
КонецФункции






Функция ОпределитьСвойстваСертификата(Данные) экспорт
	
	//кухарь 21.01.15 начало
	ТекСерт=Справочники.ПодарочныеСертификаты.НайтиПоКоду(Данные);
	если ТекСерт<>Справочники.ПодарочныеСертификаты.ПустаяСсылка() и ТекСерт<>Неопределено тогда
		Номинал=ТекСерт.Номинал;
		Номенклатура=ТекСерт.Владелец;
		если ТекСерт.Владелец<>Неопределено и ТекСерт.Владелец<>Справочники.Номенклатура.ПустаяСсылка() Тогда 
			ТабВозврата=новый ТаблицаЗначений;
			ТабВозврата.Колонки.Добавить("Номинал");
			ТабВозврата.Колонки.Добавить("Номенклатура");
			стрТВ=ТабВозврата.Добавить();
			стрТВ.Номенклатура=Номенклатура;
			стрТВ.номинал=Номинал;
			возврат ТабВозврата;		
		КонецЕсли;
	КонецЕсли;	
	//кухарь 21.01.15 конец
	
	
	
	
	
	КодСертификата	= Данные;
	Номинал			= Число(Сред(Данные,4,4));
	
	Если Номинал = 5000 тогда
		Номинал = 500;
	ИначеЕсли Номинал = 500 тогда
		Номинал = 5000;
	ИначеЕсли Номинал = 1100 тогда
		Номинал = 10000;	
	ИначеЕсли Номинал = 101 тогда
		Номинал = 100;
	ИначеЕсли Номинал = 102 тогда
		Номинал = 100;		
	КонецЕсли;
	Если Номинал = 500 Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-096562");
	ИначеЕсли Номинал = 1000 Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-095774");
		//крохин начало 22.04.2015
	ИначеЕсли Номинал = 1500 Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-370554");	
		//крохин конец 22.04.2015
	ИначеЕсли Номинал = 2000 Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-096577");
	ИначеЕсли Номинал = 3000 Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-096561");
	ИначеЕсли Номинал = 100 Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-226249");
	//крохин начало 02.02.2016
	//100 рублей франчайзинг Джулия
    ИначеЕсли Номинал = 103 Тогда
    Номинал	= 100;
	Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-381172");
	//крохин конец 02.02.2016
		//нечаева 30,10,2014 +++	
	ИначеЕсли Номинал = 200 Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-359578");	
		//нечаева 30,10,2014 *---	
	ИначеЕсли Номинал = 5000 Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-231090");
	ИначеЕсли Номинал = 7000 Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-279212");
	ИначеЕсли Номинал = 10000 Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-279214");
		//нечаева 13,10,14++	
	ИначеЕсли Номинал = 1100 тогда
		Номинал = 100;
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-357490");
	ИначеЕсли Номинал = 2200 тогда
		Номинал = 200;
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-357492");
	ИначеЕсли Номинал = 5500 тогда
		Номинал = 500;
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-357494");
		//нечаева 13,10,14 --
		//крохин начало 16.03.2015
		//сертификаты-подарки 500 рублей
	ИначеЕсли Номинал = 5600 тогда
		Номинал = 500;
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-353054");	
		//крохин конец 16.03.2015
	Иначе
		////кухарь 01.12.14 начало
		////в случае, если не определён номинал, возможно стоит брать по владельцу.
		//	//#ЕСЛИ КЛИЕНТ ТОГДА
		//	//	Сообщить("Неверный номинал сертификата");
		//	//#КонецЕсли
		//	//возврат Неопределено
		//
		////кухарь 21.01.15 начало
		////перенёс отсюда
		////Кухарь 25.08.14 начало
		//ТекСерт=Справочники.ПодарочныеСертификаты.НайтиПоКоду(КодСертификата);
		//если ТекСерт<>Справочники.ПодарочныеСертификаты.ПустаяСсылка() и ТекСерт<>Неопределено тогда
		//	Номинал=ТекСерт.Номинал;
		//	Номенклатура=ТекСерт.Владелец;
		//КонецЕсли;
		////Кухарь 25.08.14 конец
		////кухарь 21.01.15 конец
		
		//
		////кухарь 01.12.14 конец
	КонецЕсли;
	
	
	
	ТабВозврата=новый ТаблицаЗначений;
	ТабВозврата.Колонки.Добавить("Номинал");
	ТабВозврата.Колонки.Добавить("Номенклатура");
	стрТВ=ТабВозврата.Добавить();
	стрТВ.Номенклатура=Номенклатура;
	стрТВ.номинал=Номинал;
	возврат ТабВозврата;
	
КонецФункции

функция ПровестиДокументПоСертификатнымОстаткам(Документ) экспорт
	ПредварительныйРезультат=истина;
	ХПС=получитьХПС(Документ,Неопределено);
	если хпс=Неопределено тогда Возврат Истина КонецЕсли;
	
	РазныеСертификаты=новый ТаблицаЗначений;
	РазныеСертификаты.Колонки.Добавить("Номенклатура");
	РазныеСертификаты.Колонки.Добавить("Количество");
	для каждого СтрокаТовара из Документ.товары цикл
		если СтрокаТовара.номенклатура.родитель.родитель.код="SNL-095760" тогда
			стрТаб=РазныеСертификаты.Добавить();
			стрТаб.номенклатура=СтрокаТовара.номенклатура;
			стрТаб.количество=СтрокаТовара.количество;
		КонецЕсли;	
	КонецЦикла;
	
	если ХПС.сертификаты.количество() = 0 и РазныеСертификаты.Количество() = 0 тогда
		Возврат Истина;	
	КонецЕсли;
	//определение необходимости проводок по складу
	если документ.метаданные().имя<>"Перемещение" тогда
		если документ.склад.кодфизическогоузла=ПараметрыСеанса.ЭтотУзел.Код тогда
			ДелаемПроводкиСписания=истина;
			ДелаемПроводкиОприходования=Истина;
		иначе 
			ДелаемПроводкиСписания=ложь;
			ДелаемПроводкиОприходования=ложь;
		КонецЕсли;
	иначе
		если документ.склад.кодфизическогоузла=ПараметрыСеанса.ЭтотУзел.Код тогда
			ДелаемПроводкиСписания=истина;
		Иначе 
			ДелаемПроводкиСписания=ложь;
		КонецЕсли;
		
		если документ.складполучатель.кодфизическогоузла=ПараметрыСеанса.ЭтотУзел.Код тогда
			ДелаемПроводкиОприходования=истина;
		Иначе 
			ДелаемПроводкиОприходования=ложь;
		КонецЕсли;		
	КонецЕсли;
	
	если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
		ДелаемПроводкиСписания=Истина;
		ДелаемПроводкиОприходования=Истина;
	КонецЕсли;
	//определение необходимости проводок по складу
	
	//кухарь 25.08.14 начало 
	если документ.метаданные().имя<>"ОтчетКассовойСмены" тогда
		для каждого СтрТовары из документ.товары цикл
			ТекТов=хпс.сертификаты.найти(СтрТовары.номенклатура);
			Если ТекТов= Неопределено тогда
				#ЕСЛИ КЛИЕНТ ТОГДА
					Сообщить(СтрТовары.Номенклатура.Наименование+" отсутствует во вкладке сертификаты");
				#КонецЕсли
				ПредварительныйРезультат= Ложь;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
	если ПредварительныйРезультат тогда
		//кухарь 25.08.14 конец		
		
		
		
		//запрет проведением с не совпадением количества серт в разных вкладках
		если документ.метаданные().имя="Перемещение" тогда	
			таб=ХПС.Сертификаты.выгрузить();
			таб.Свернуть("Номенклатура","Принято,Количество");
			//для каждого НомСерт из таб цикл
			//	серт=документ.Товары.найти(НомСерт.номенклатура);
			//	если серт=Неопределено тогда
			//		серт=документ.товары.добавить();
			//	КонецЕсли;
			//	серт.Номенклатура=НомСерт.номенклатура;
			//	серт.Заявка=НомСерт.количество;
			//	серт.ПодтвержденнаяЗаявка=НомСерт.количество;
			//	серт.ПодтвержденнаяЗаявкаПеремещения=НомСерт.количество;
			//	если Документ.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
			//		серт.Количество=НомСерт.принято;
			//	иначе 
			//		серт.Количество=НомСерт.количество;
			//	КонецЕсли;
			//	серт.СтавкаНДС=Перечисления.СтавкиНДС.НДС18;
			//КонецЦикла;
			РазныеСертификаты=новый ТаблицаЗначений;
			РазныеСертификаты.Колонки.Добавить("Номенклатура");
			РазныеСертификаты.Колонки.Добавить("Количество");
			для каждого СтрокаТовара из Документ.товары цикл
				если СтрокаТовара.номенклатура.родитель.родитель.код="SNL-095760" тогда
					стрТаб=РазныеСертификаты.Добавить();
					стрТаб.номенклатура=СтрокаТовара.номенклатура;
					стрТаб.количество=СтрокаТовара.количество;
				КонецЕсли;	
			КонецЦикла;
			
			
			
			
			для каждого НомСерт из РазныеСертификаты цикл
				
				СтрТов=таб.Найти(НомСерт.номенклатура);
				если СтрТов=Неопределено тогда
					#ЕСЛИ КЛИЕНТ ТОГДА
						Сообщить(НомСерт.Номенклатура.Наименование+" отсутствует во вкладке сертификаты");
					#КонецЕсли
					ПредварительныйРезультат= Ложь;
				КонецЕсли;
				если Документ.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.Принята тогда
					если СтрТов.принято<>НомСерт.Количество тогда
						#ЕСЛИ КЛИЕНТ ТОГДА
							Сообщить("Не совпадает количество сертификатов "+СтрТов.Номенклатура.Наименование+ "во вкладках Товары и Сертификаты");
						#КонецЕсли
						ПредварительныйРезультат= ложь;
					КонецЕсли;
					
				иначе 
					если СтрТов.количество<>НомСерт.Количество тогда
						#ЕСЛИ КЛИЕНТ ТОГДА
							Сообщить("Не совпадает количество сертификатов "+СтрТов.Номенклатура.Наименование+ "во вкладках Товары и Сертификаты");
						#КонецЕсли
						ПредварительныйРезультат= ложь;
					КонецЕсли;
					
				КонецЕсли;
				
				
			КонецЦикла;
			
			
		Иначеесли  документ.метаданные().имя<>"Инвентаризация"  тогда 
			таб=ХПС.Сертификаты.выгрузить();
			таб.Свернуть("Номенклатура","Количество");
			//если документ.метаданные().имя<>"ОтчетКассовойСмены" тогда
			//для каждого НомСерт из таб цикл
			//	серт=документ.Товары.найти(НомСерт.номенклатура);
			//	если серт=Неопределено тогда
			//		серт=документ.товары.добавить();
			//	КонецЕсли;
			//	
			//	серт.Номенклатура=НомСерт.номенклатура;	
			//	серт.Количество=НомСерт.количество;
			//	серт.СтавкаНДС=Перечисления.СтавкиНДС.НДС18;
			//	попытка
			//		серт.Заявка=НомСерт.количество;
			//		серт.ПодтвержденнаяЗаявка=НомСерт.количество;
			//	Исключение
			//	КонецПопытки;
			//КонецЦикла;
			//КонецЕсли;
			РазныеСертификаты=новый ТаблицаЗначений;
			РазныеСертификаты.Колонки.Добавить("Номенклатура");
			РазныеСертификаты.Колонки.Добавить("Количество");
			для каждого СтрокаТовара из Документ.товары цикл
				если СтрокаТовара.номенклатура.родитель.родитель.код="SNL-095760" тогда
					стрТаб=РазныеСертификаты.Добавить();
					стрТаб.номенклатура=СтрокаТовара.номенклатура;
					стрТаб.количество=СтрокаТовара.количество;
				КонецЕсли;	
			КонецЦикла;
			
			РазныеСертификаты.Свернуть("Номенклатура","Количество");
			
			
			таб=ХПС.Сертификаты.выгрузить();
			таб.Свернуть("Номенклатура","Количество");
			если документ.метаданные().имя<>"ОтчетКассовойСмены" тогда
				
				для каждого НомСерт из РазныеСертификаты цикл
					СтрТов=таб.Найти(НомСерт.номенклатура);
					если СтрТов=Неопределено тогда
						#ЕСЛИ КЛИЕНТ ТОГДА
							Сообщить(НомСерт.Номенклатура.Наименование+" отсутствует во вкладке сертификаты");
						#КонецЕсли
						ПредварительныйРезультат= Ложь;
					КонецЕсли;
					
					если СтрТов.Количество<>НомСерт.Количество тогда
						#ЕСЛИ КЛИЕНТ ТОГДА
							Сообщить("Не совпадает количество сертификатов "+СтрТов.Номенклатура.Наименование+ "во вкладках Товары и Сертификаты");
						#КонецЕсли
						ПредварительныйРезультат= ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		иначе	
			таб=ХПС.Сертификаты.выгрузить();
			таб.Свернуть("Номенклатура","Количество,количествоРасч,КоличествоФакт");
			//для каждого НомСерт из таб цикл
			//	серт=документ.Товары.найти(НомСерт.номенклатура);
			//	если серт=Неопределено тогда
			//		серт=документ.товары.добавить();
			//	КонецЕсли;
			//	
			//	серт.Номенклатура=НомСерт.номенклатура;	
			//	серт.Количество=НомСерт.количество;
			//	серт.СтавкаНДС=Перечисления.СтавкиНДС.НДС18;
			//	серт.количествоРасч=НомСерт.количествоРасч;
			//	серт.количествоФакт=НомСерт.количествоФакт;
			//	
			//	попытка
			//		серт.Заявка=НомСерт.количество;
			//		серт.ПодтвержденнаяЗаявка=НомСерт.количество;
			//	Исключение
			//	КонецПопытки;
			//КонецЦикла;
			
			РазныеСертификаты=новый ТаблицаЗначений;
			РазныеСертификаты.Колонки.Добавить("Номенклатура");
			РазныеСертификаты.Колонки.Добавить("Количество");
			
			для каждого СтрокаТовара из Документ.товары цикл
				если СтрокаТовара.номенклатура.родитель.родитель.код="SNL-095760" тогда
					стрТаб=РазныеСертификаты.Добавить();
					стрТаб.номенклатура=СтрокаТовара.номенклатура;
					стрТаб.количество=СтрокаТовара.количество;
				КонецЕсли;	
			КонецЦикла;
			
			
			
			
			таб=ХПС.Сертификаты.выгрузить();
			таб.Свернуть("Номенклатура","Количество");
			
			для каждого НомСерт из РазныеСертификаты цикл
				СтрТов=таб.Найти(НомСерт.номенклатура);
				если СтрТов=Неопределено тогда
					#ЕСЛИ КЛИЕНТ ТОГДА
						Сообщить(НомСерт.Номенклатура.Наименование+" отсутствует во вкладке сертификаты");
					#КонецЕсли
					ПредварительныйРезультат= Ложь;
				КонецЕсли;
				
				если СтрТов.Количество<>НомСерт.Количество тогда
					#ЕСЛИ КЛИЕНТ ТОГДА
						Сообщить("Не совпадает количество сертификатов "+СтрТов.Номенклатура.Наименование+ "во вкладках Товары и Сертификаты");
					#КонецЕсли
					
					ПредварительныйРезультат= ложь;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		//запрет проведением с не совпадением количества серт в разных вкладках
		//документ=документы.Инвентаризация.НайтиПоНомеру();
		//кухарь 25.08.14 начало
		//закомментировал за ненадобностью
		//Документ.Товары.Сортировать("Номенклатура");
		//кухарь 25.08.14 конец
		//кухарь 25.08.14 начало 		
	КонецЕсли;
	//кухарь 25.08.14 конец 	
	//списание с остатков
	если ДелаемПроводкиСписания и (Документ.метаданные().имя="Инвентаризация" или документ.метаданные().имя="СписаниеТМЦ" 
		или документ.метаданные().имя="Перемещение" или документ.метаданные().имя="РасходнаяНакладная" или документ.метаданные().имя="ОтчетКассовойСмены") тогда
		
		РезультатСписания=СписаниеСертификатныхОстатков(Документ,ХПС);
		
	иначе РезультатСписания=Истина	
	КонецЕсли;
	
	//оприходования на остатки
	если ДелаемПроводкиОприходования и (Документ.метаданные().имя="Инвентаризация" или Документ.метаданные().имя="ОприходованиеТМЦ" 
		или документ.метаданные().имя="Перемещение"  или документ.метаданные().имя="ПриходнаяНакладная") тогда
		
		РезультатОприходования=ОприходованиеСертификатныхОстатков(Документ,ХПС);
	иначе РезультатОприходования=Истина	
	КонецЕсли;
	
	
	
	
	если РезультатСписания и РезультатОприходования Тогда 
		возврат Истина;
	иначе
		ПредварительныйРезультат= ложь;
	КонецЕсли;
	
	
	если ПредварительныйРезультат=Истина Тогда 
		Возврат Истина;
	Иначе
		если ПараметрыСеанса.ЭтотУзел.Код="SNL" тогда
			Возврат Истина;
		КонецЕсли;
		#ЕСЛИ Сервер ТОГДА
			Возврат Истина;
		#КонецЕсли
		
		Возврат ложь;
	КонецЕсли;
	
КонецФункции

//крохин начало 28.01.2017
//установка флага "подарок"
//функция СоздатьСертификатВДокументе(СтрокаТЧ)  экспорт
функция СоздатьСертификатВДокументе(СтрокаТЧ, Подарок = Ложь)  экспорт
//крохин конец 28.01.2017	
	//завести сертификат
	//если СтрокаТЧ.Сертификат<>Справочники.ПодарочныеСертификаты.ПустаяСсылка() тогда Продолжить;
	//КонецЕсли;
	ИщемСерт=Справочники.ПодарочныеСертификаты.НайтиПоКоду(СтрокаТЧ.КодСертификата);
	если ИщемСерт<>Неопределено и ИщемСерт<>Справочники.ПодарочныеСертификаты.ПустаяСсылка() Тогда 
		Возврат ИщемСерт
	КонецЕсли;
	
	
	СертификатОбъект=Справочники.ПодарочныеСертификаты.СоздатьЭлемент();		
	СертификатОбъект.Владелец				=СтрокаТЧ.Номенклатура;				
	СертификатОбъект.Код					=СтрокаТЧ.КодСертификата;
	СертификатОбъект.Номинал                =СтрокаТЧ.Номинал; 
	СертификатОбъект.СрокДействия			=360;
	СертификатОбъект.ПодразделениеПолучатель=ПараметрыСеанса.ЭтотУзел.Подразделение;				
	СертификатОбъект.КодСертификата     =СтрокаТЧ.КодСертификата;
	//
	//   			Если КодОперации=Перечисления.КодыОперацийПС.Дарение Тогда
	//   				СертификатОбъект.Подарок 		= Истина;
	//   				СертификатОбъект.ДатаВыдачи 	= Дата;	
	//   			КонецЕсли;				
	//СертификатОбъект.Документ			=документ.Ссылка;			
	СертификатОбъект.ВидСертификата		=Справочники.ВидыПодарочныхСертификатов.ЕЕ;	
	
	// нечаева 15,10,14 ++ для подарочных карт
	Если СтрокаТЧ.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-357490") или 
		СтрокаТЧ.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-357492") или
	//крохин начало 28.01.2017
	//сертификаты-подарки 500 рублей
	СтрокаТЧ.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-353054") или	
	//крохин конец 28.01.2017
		СтрокаТЧ.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-357494")
		Тогда	
		
		СертификатОбъект.Подарок = истина;
		
	КонецЕсли;
	// нечаева 15,10,14 --
	
	//крохин начало 28.01.2017
	//установка флага "подарок"
	Если Подарок Тогда
		СертификатОбъект.Подарок = истина;
	КонецЕсли;
	//крохин конец 28.01.2017
	
	СертификатОбъект.Записать();
	ИщемСерт=Справочники.ПодарочныеСертификаты.НайтиПоКоду(СтрокаТЧ.КодСертификата);
	
	Возврат ИщемСерт;
	
	
КонецФункции


//Кухарь 25.05.15 начало
//Добавил передачу формы, для выделения текущей строки при сканировании
//процедура СканированиеСертификатов(Сертификаты,данные,Документ) экспорт
процедура СканированиеСертификатов(Сертификаты,данные,Документ,форма=Неопределено) экспорт
//Кухарь 25.05.15 конец	
	Данные=СокрЛП(Данные);
	Если Лев(Данные,2)="00" И СтрДлина(Данные)=12 Тогда //странный глюк сканера
		Данные="0"+Данные;					
	КонецЕсли;
	
	ТекСертификат=Справочники.ПодарочныеСертификаты.НайтиПоКоду(Данные);
	если ТекСертификат <> Неопределено и ТекСертификат<>Справочники.ПодарочныеСертификаты.ПустаяСсылка() тогда
		//крохин начало 20.01.2017
		//возможен возврат через ПНК
		//Если ЗначениеЗаполнено(ТекСертификат.ДатаВыдачи) Тогда
		Если ЗначениеЗаполнено(ТекСертификат.ДатаВыдачи) И НЕ (документ.метаданные().имя = "ПриходнаяНакладная" И Документ.кодоперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя) Тогда
		//крохин конец 20.01.2017	
			Сообщить("Сертификат: "+ТекСертификат.Код+" уже выдавался !");
			Возврат
		ИначеЕсли ЗначениеЗаполнено(ТекСертификат.ДатаПогашения) Тогда
			Сообщить("Сертификат: "+ТекСертификат.Код+" погашен !");	
			Возврат
		ИначеЕсли ТекСертификат.Комментарий<>"" тогда
			Сообщить(ТекСертификат.Комментарий);
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	ЭтоПриемщик=ложь;
	ВидДокумента=документ.метаданные().имя;
	
	СтарСерт=сертификаты.Найти(данные);
	//СтарСерт=найти(сертификаты,данные);
	
	//для получателей в ПРМ
	если ВидДокумента="Перемещение" тогда
		КодПолучателя=документ.складполучатель.кодфизическогоузла ;
		если  ПараметрыСеанса.ЭтотУзел.Код=КодПолучателя  или (документ.складполучатель=Справочники.Склады.НайтиПоКоду("SSP-56") и ПараметрыСеанса.ЭтотУзел.Код="SNL") Тогда 
			ЭтоПриемщик=Истина;
		КонецЕсли;
		
	иначе
		КодПолучателя="";
	КонецЕсли;	
	//для получателей в ПРМ
	
	//контроль наличия при сканировании
	если ТекСертификат<>Неопределено и ТекСертификат<>Справочники.ПодарочныеСертификаты.ПустаяСсылка() и (ВидДокумента="СписаниеТМЦ" или ВидДокумента="РасходнаяНакладная" или (ВидДокумента="Перемещение" и ПараметрыСеанса.ЭтотУзел.Код<>КодПолучателя))  тогда
		
		// Кухарь А.Ю. 19.08.2021 начало
		//если Документ.склад.родитель<>Справочники.Склады.НайтиПоКоду("SSP-64") тогда
		если Документ.склад.родитель<>Справочники.Склады.НайтиПоКоду("SSP-64") и Документ.склад.код<>"SSX-66" тогда		 
			// Кухарь А.Ю. 19.08.2021 конец	
			КолЭтогоСерт=КонтрольКоличестваСертификатов(ТекСертификат,Документ.склад,Документ.дата);
			Если КолЭтогоСерт<=0 тогда
				Сообщить("Сертификата нет на остатках выбранного склада");
				возврат;
			КонецЕсли;	
		КонецЕсли;
	иначеесли ТекСертификат<>Неопределено и ТекСертификат<>Справочники.ПодарочныеСертификаты.ПустаяСсылка() и  Документ.метаданные().имя="ОприходованиеТМЦ" или документ.метаданные().имя="ПриходнаяНакладная" или (ВидДокумента="Перемещение" и ПараметрыСеанса.ЭтотУзел.Код=КодПолучателя) тогда
		если ВидДокумента<>"Перемещение" тогда
			КолЭтогоСерт=КонтрольКоличестваСертификатов(ТекСертификат,Документ.склад,ТекущаяДата());
		иначе
			КолЭтогоСерт=КонтрольКоличестваСертификатов(ТекСертификат,Документ.складполучатель,ТекущаяДата());
			
		КонецЕсли;
				//крохин начало 25.01.2017
		//для возвратов день в день  контроль не нужен
		Если документ.метаданные().имя="ПриходнаяНакладная" И Документ.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя  Тогда
			Если НачалоДня(ТекСертификат.ДатаВыдачи) = НачалоДня(ТекущаяДата()) Тогда
			КолЭтогоСерт = 0;
		    КонецЕсли;
			Если ПустаяСтрока(ТекСертификат.НомерЧекаВыдачи) Тогда
				Сообщить("сертификат не выдавался, возврат невозможен!");
				Возврат;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ТекСертификат.НомерЧекаПогашения) ИЛИ ТекСертификат.Использован Тогда
				Сообщить("сертификат уже был использован, возврат невозможен!");
			КонецЕсли;
		КонецЕсли;
		
			//крохин конец 25.01.2017
		если КолЭтогоСерт>=1 тогда
			Сообщить("Этот сертификат уже оприходовался на остатки");
			Возврат ;
		КонецЕсли;
	КонецЕсли;
	
	//контроль наличия при сканировании
	
	//сертификаты заводи только в ОПР и ИНВ	
		если (ТекСертификат=Неопределено или ТекСертификат=Справочники.ПодарочныеСертификаты.ПустаяСсылка()) и (ВидДокумента<>"Инвентаризация" и ВидДокумента<>"ОприходованиеТМЦ" и ВидДокумента<>"Перемещение" и ВидДокумента<>"ПриходнаяНакладная") тогда

		Сообщить("сертификат не найден");	
		Возврат	
	КонецЕсли;
	//сертификаты заводи только в ОПР и ИНВ	
	
	//крохин начало 26.01.2017
	//в ТЦ нельзя делать ПНК на сертификаты, кроме возвратов
	если (ТекСертификат=Неопределено или ТекСертификат=Справочники.ПодарочныеСертификаты.ПустаяСсылка()) И (ВидДокумента="ПриходнаяНакладная" И ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение) Тогда
		Сообщить("сертификат не найден");	
		Возврат	
	КонецЕсли;
    //крохин конец 26.01.2017	
	
	если СтарСерт=Неопределено тогда
		ТекСертификат=Справочники.ПодарочныеСертификаты.НайтиПоКоду(Данные);
		СвойстваДобСерт=УчетСертификатов.ОпределитьСвойстваСертификата(Данные);
		если СвойстваДобСерт=Неопределено тогда Возврат  КонецЕсли;	
		ДобСерт=Сертификаты.Добавить();
		если ТекСертификат=Справочники.ПодарочныеСертификаты.ПустаяСсылка() тогда
			ДобСерт.КодСертификата=Данные;	
			ДобСерт.Номинал=СвойстваДобСерт.получить(0).номинал;
		Иначе 
			ДобСерт.Сертификат=ТекСертификат;
			ДобСерт.КодСертификата=ТекСертификат.Код;
			ДобСерт.Номинал=ТекСертификат.Номинал;
		КонецЕсли;
		ДобСерт.Номенклатура=СвойстваДобСерт.получить(0).Номенклатура;
		
		
		
		если ВидДокумента="Инвентаризация" тогда
			ДобСерт.КоличествоФакт=1;	
			ДобСерт.Количество=ДобСерт.КоличествоФакт-ДобСерт.КоличествоРасч;
			
			
		ИначеЕсли ЭтоПриемщик Тогда 
			ДобСерт.Принято=1;
		Иначе 	
			добСерт.Количество=1;
		КонецЕсли;
		ДобСерт.Всего=ДобСерт.Количество*ДобСерт.Номинал;
		//Кухарь 25.05.15 начало
		//крохин начало 06.12.2017
		//теперь для всех документов
		//если ВидДокумента="Инвентаризация" тогда
		Если форма <> Неопределено Тогда
		//крохин конец 06.12.2017	
			Форма.элементыформы.сертификаты.текущаястрока=ДобСерт;
		КонецЕсли;
		//Кухарь 25.05.15 конец
	иначе
		если ВидДокумента="Инвентаризация" тогда
			//Кухарь 25.05.15 начало
			//Чтобы искать дубли сертификатов было легче
			//если старсерт.Количество<=0 или СтарСерт.КоличествоФакт<=0 тогда
			если СтарСерт.КоличествоФакт=1 тогда
				Сообщить("Сертификат "+СтарСерт.КодСертификата+" отсканирован повторно");
			КонецЕсли;
			Форма.элементыформы.сертификаты.текущаястрока=СтарСерт;
			//Кухарь 25.05.15 конец
			
			СтарСерт.КоличествоФакт=СтарСерт.КоличествоФакт+1;
			СтарСерт.Количество=СтарСерт.КоличествоФакт-СтарСерт.КоличествоРасч;
			СтарСерт.Всего=СтарСерт.Номинал*(СтарСерт.КоличествоФакт-СтарСерт.КоличествоРасч);
			//Кухарь 25.05.15 начало
			//Чтобы искать дубли сертификатов было легче
			//иначе
			//сообщить(СтарСерт.КодСертификата+ " уже присутствует в этом документе");
			//КонецЕсли;
			//Кухарь 25.05.15 конец
		ИначеЕсли ЭтоПриемщик Тогда 
			СтарСерт.Принято=1;
			
		иначе
			если старсерт.Количество<=0 тогда
				
				СтарСерт.Количество=СтарСерт.Количество+1;
				СтарСерт.Всего=СтарСерт.Номинал*СтарСерт.Количество;
			иначе
				сообщить(СтарСерт.КодСертификата+ " уже присутствует в этом документе");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	//крохин начало 25.01.2017
	//для возвратных ПНК попробуем найти чек и заполнить реквизиты ПНК по нему
	Если ВидДокумента = "ПриходнаяНакладная" И Документ.кодоперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда
		если СтарСерт<>Неопределено тогда
			ТекСертификат = СтарСерт;
		КонецЕсли;
		Если ТекСертификат.ПодразделениеВыдачи = Документ.Подразделение Тогда
			ЧекВыдачи = Документы.Чек.НайтиПоНомеру(ТекСертификат.НомерЧекаВыдачи,ТекСертификат.ДатаВыдачи);
			Если НЕ ЧекВыдачи.Пустая() Тогда
				Документ.ДокОснование = ЧекВыдачи;
				Если ЧекВыдачи.ВидОплаты = Перечисления.ВидыОплаты.БН Тогда
					Документ.ВозвратПК = Истина;
				Иначе
					Документ.ВозвратПК = Ложь;
				КонецЕсли;	
			Иначе
				Сообщить("Чек продажи сертификата не обнаружен! Установите вид оплаты в соответствии с бумажным чеком!");		
			КонецЕсли;
		Иначе
			Сообщить("Сертификат был продан в: " + ТекСертификат.ПодразделениеВыдачи + ". Установите вид оплаты в соответствии с бумажным чеком!");	
		КонецЕсли;
	КонецЕсли;
		//крохин конец 25.01.2017
КонецПроцедуры



процедура УдалениеКомментариевСписанныхСертификатов(документ) экспорт
	ХПС=получитьХПС(Документ,Неопределено);
	если ХПС<>Неопределено тогда
		СписокСписанныхСертификатов=новый СписокЗначений;
		Для каждого СтрокаСерт из ХПС.сертификаты цикл
			// для инвентаризаций
			если документ.метаданные().имя<>"Инвентаризация" тогда
				количество=СтрокаСерт.количество;
			иначе
				количество=-СтрокаСерт.количество;
			КонецЕсли;
			если количество<=0 Тогда Продолжить КонецЕсли;
			
			СписокСписанныхСертификатов.Добавить(СтрокаСерт.Сертификат);
			
			
		КонецЦикла;
		для каждого ССС из СписокСписанныхСертификатов цикл
			ССерт=ссс.Значение.получитьобъект();
			ССерт.комментарий="";
			ССерт.записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры



функция СписаниеСертификатныхОстатков(документ,ХПС)
	//кухарь начало 28.10.2013 
	если Документ.склад=Справочники.Склады.НайтиПоКоду("SSX-66") тогда Возврат Истина КонецЕсли;
	//кухарь конец 28.10.2013
	
	если (документ.метаданные().имя="СписаниеТМЦ" или документ.метаданные().имя="Перемещение") и документ.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе тогда
		Возврат Истина
	КонецЕсли;
	
	//крохин начало 25.08.2022
	//возврат не ставит сертификат на сертификатные остатки
	Если документ.метаданные().Имя = "ОтчетКассовойСмены" Тогда
		Возврат Истина;
	КонецЕсли;
	//крохин конец 25.08.2022
	
	
	
	СписаниевМинус=ложь;
	СписокСписанныхСертификатов=новый СписокЗначений;
	
	//кухарь 23.12.13 начало
	//оптимизация контроля сертификатных остатков
	//кухарь 20.01.14 начало
	//СписокСерт=КонтрольКоличестваСертификатовСписком(хпс.Сертификаты.ВыгрузитьКолонки("Сертификат"),документ.склад,ТекущаяДата());
	//крохин начало 02.10.2014
	//СписокСерт=КонтрольКоличестваСертификатовСписком(хпс.Сертификаты.ВыгрузитьКолонку("Сертификат"),Документ.склад,Документ.дата);
	СписокСерт=КонтрольКоличестваСертификатовСписком(хпс.Сертификаты.ВыгрузитьКолонку("Сертификат"),Документ.склад,новый граница(Документ.МоментВремени(),видграницы.Исключая));
	//крохин конец 02.10.2014
	//кухарь 20.01.14 конец	
	
	
	//кухарь 09.01.14 начало
	если СписокСерт=Неопределено тогда 
		возврат Истина;
	КонецЕсли;
	//кухарь 09.01.14 конец
	
	
	для Каждого ТекСерт из СписокСерт Цикл 
		Если ТекСерт.количество<1 тогда
			#ЕСЛИ КЛИЕНТ ТОГДА
				Сообщить("Сертификат с кодом "+ТекСерт.Сертификат+" отсутствует на остатках по данному складу");
			#КонецЕсли
			СписаниевМинус=Истина;
		КонецЕсли;	
	КонецЦикла;
	//кухарь 23.12.13 конец
	
	Для каждого СтрокаСерт из ХПС.сертификаты цикл
		// для инвентаризаций
		если документ.метаданные().имя<>"Инвентаризация" тогда
			количество=СтрокаСерт.количество;
		иначе
			количество=-СтрокаСерт.количество;
		КонецЕсли;
		если количество<=0 Тогда Продолжить КонецЕсли;
		
		
		//КолЭтогоСерт=КонтрольКоличестваСертификатов(СтрокаСерт.сертификат,Документ.склад,Документ.дата);
		//Если КолЭтогоСерт<=0 тогда
		//	#ЕСЛИ КЛИЕНТ ТОГДА			
		//		Сообщить("Сертификат с кодом "+СтрокаСерт.КодСертификата+" отсутствует на остатках по данному складу");
		//	#КонецЕсли
		//	СписаниевМинус=Истина;
		//	Продолжить;
		//КонецЕсли;	
		//
		// для инвентаризаций
		
		//документ=документы.Инвентаризация.НайтиПоНомеру().получитьобъект();	 
		
		Движение = документ.Движения.СертификатныеОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = документ.Дата;
		Движение.Склад =документ.Склад;		
		Движение.Сертификат = СтрокаСерт.Сертификат;
		Движение.Количество = количество;
		Движение.Сумма = СтрокаСерт.Номинал*количество;
		Движение.Регистратор=документ.Ссылка;
		Движение.Подразделение=Документ.Склад.Подразделение;
		
		если документ.метаданные().имя="Инвентаризация" или документ.метаданные().имя="СписаниеТМЦ"  тогда
			движение.КодОперации=Перечисления.КодыОперацийОстатки.Списание;
		ИначеЕсли 
			документ.метаданные().имя="Перемещение" тогда
			движение.КодОперации=Перечисления.КодыОперацийОстатки.Перемещение;
		ИначеЕсли 
			документ.метаданные().имя="ОтчетКассовойСмены" или документ.метаданные().имя="Чек" или документ.метаданные().имя="РасходнаяНакладная"   тогда
			движение.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;			
		КонецЕсли;		
		
		если движение.КодОперации=Перечисления.КодыОперацийОстатки.Списание тогда
			СписокСписанныхСертификатов.Добавить(СтрокаСерт.Сертификат);
		КонецЕсли;
		
	КонецЦикла;
	//Кухарь 28.10.13 начало 
	//было
	//	для каждого ССС из СписокСписанныхСертификатов цикл
	//	ССерт=ссс.Значение.получитьобъект();
	//	ССерт.комментарий="Данный сертификат был списан документом " + документ.ссылка+", к оплате просьба не принимать. Обратитесь в тех поддержку!!!";
	//	ССерт.записать();
	//КонецЦикла;
	//
	//
	//если СписаниевМинус тогда
	//	возврат ложь;
	//КонецЕсли;
	//
	//
	//
	//возврат Истина
	
	//стало
	если не СписаниевМинус или  РольДоступна("Администратор") тогда
		//кухарь 14.11.13 начало	
		////кухарь 02.02.15 начало
		////перенесу на форму документов
		//если документ.метаданные().имя="Инвентаризация" или  документ.метаданные().имя="СписаниеТМЦ"  тогда 
		//	если документ.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена Тогда 
		//		для каждого ССС из СписокСписанныхСертификатов цикл
		//			ССерт=ссс.Значение.получитьобъект();
		//			ССерт.комментарий="Данный сертификат был списан документом " + документ.ссылка+", к оплате просьба не принимать. Обратитесь в тех поддержку!!!";
		//			ССерт.записать();
		//		КонецЦикла;
		//	КонецЕсли;
		//КонецЕсли;
		////кухарь 02.02.15 конец
		//кухарь 14.11.13 конец		
		
		
		
		
		возврат Истина
		
	иначе
		если СписаниевМинус тогда
			возврат ложь;
		КонецЕсли;		
	КонецЕсли;
	//кухарь 28.10.13 конец
	
КонецФункции

функция ОприходованиеСертификатныхОстатков (Документ,ХПС)
	
	
	если документ.метаданные().имя="Перемещение" и документ.СостояниеНакладнойУПолучателя<>Перечисления.СостоянияНакладной.Принята  тогда
		//кухарь 25.08.14 начало
		//закомментировал за ненадобностью
		//	Документ.НеСоответствуетЗаявке=ложь;
		//кухарь 25.08.14 конец
		Возврат Истина
	КонецЕсли;
	
	
	//кухарь 23.12.13 начало	
	//оптимизация контроля сертификатных остатков
	если документ.метаданные().имя="Перемещение" тогда
		склад=документ.складполучатель;
	иначе
		склад=документ.склад;
	КонецЕсли;	
	//кухарь 20.01.14 начало
	//СписокСерт=КонтрольКоличестваСертификатовСписком(хпс.Сертификаты.ВыгрузитьКолонки("Сертификат"),склад,ТекущаяДата());
	//крохин начало 02.10.2014
	//проверка остатков должна быть на дату документа
	//СписокСерт=КонтрольКоличестваСертификатовСписком(хпс.Сертификаты.ВыгрузитьКолонку("Сертификат"),склад,ТекущаяДата());
	СписокСерт=КонтрольКоличестваСертификатовСписком(хпс.Сертификаты.ВыгрузитьКолонку("Сертификат"),склад,новый граница(Документ.МоментВремени(),видграницы.Исключая));	
	//крохин конец 02.10.2014
	//кухарь 20.01.14 конец	
	//кухарь 09.01.14 начало
	если СписокСерт=Неопределено тогда 
		возврат Истина;
	КонецЕсли;
	//кухарь 09.01.14 конец
	
	
	для Каждого ТекСерт из СписокСерт Цикл 
					//крохин начало 25.01.2017
			//Для ПНК-возвратов день в день контроль не нужен
			Если Документ.метаданные().Имя = "ПриходнаяНакладная" и Документ.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя  И НачалоДня(Документ.Дата) = НачалоДня(Документ.ДокОснование.Дата) Тогда
				Продолжить;
			КонецЕсли;
            //крохин конец 25.01.2017
		//кухарь начало 12.02.14
		//Если ТекСерт.количество>=1 тогда
		//кухарь 03.03.14 начало
		//крохин начало 02.10.2014
		//ищем сертификат по элементу справочника, а не по коду
		//если хпс.сертификаты.найти(тексерт.сертификат) <> Неопределено тогда
		ТекСтрока = хпс.сертификаты.найти(тексерт.сертификатСсылка,"Сертификат");		
		если ТекСтрока <> Неопределено тогда
			//крохин конец 02.10.2014
			//кухарь 03.03.14  конец	
			//крохин начало 02.10.2014
			//ищем сертификат по элементу справочника, а не по коду
			//Если ТекСерт.количество>=1 и хпс.сертификаты.найти(тексерт.сертификат).количество>0 тогда
			Если ТекСерт.количество>=1 и ТекСтрока.количество>0 тогда
			//крохин конец 25.01.2017	
				//крохин конец 02.10.2014	
				//кухарь конец 12.02.14
				#ЕСЛИ КЛИЕНТ ТОГДА
					Сообщить("Сертификат с кодом "+ТекСерт.Сертификат+" уже оприходован на остатки данного склада");
				#КонецЕсли
				//возврат ложь;
			КонецЕсли;
			//кухарь 03.03.14 начало
		КонецЕсли;
		//кухарь 03.03.14 конец
	КонецЦикла;
	//кухарь 23.12.13 конец	
	
	
	Для каждого СтрокаСерт из ХПС.сертификаты цикл
		
		
		//для ПРМ
		если документ.метаданные().имя="Перемещение" тогда
			//кухарь начало 28.10.2013 
			если Документ.СкладПолучатель=Справочники.Склады.НайтиПоКоду("SSX-66") тогда Возврат Истина КонецЕсли;
			//кухарь конец 28.10.2013
			
			склад=документ.складполучатель;
			Подразделение=склад.подразделение;
			Количество=СтрокаСерт.принято;	
			Документ.НеСоответствуетЗаявке=ложь;
		иначе
			Количество=СтрокаСерт.Количество;
			склад=документ.склад;
			попытка
				Подразделение=документ.подразделение;
			Исключение
				подразделение=документ.склад.подразделение;
			КонецПопытки;
		КонецЕсли;
		
		
		// для инвентаризаций
		если Количество<=0 Тогда Продолжить КонецЕсли;;
		// для инвентаризаций
		
		
		
		
		Движение = документ.Движения.СертификатныеОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = документ.Дата;	
		Движение.Сертификат = СтрокаСерт.Сертификат;
		Движение.Сумма = СтрокаСерт.Номинал*Количество;
		Движение.Регистратор=документ.Ссылка;
		Движение.Подразделение=Подразделение;
		Движение.Склад =склад;
		Движение.Количество = Количество;
		
		
		если документ.метаданные().имя="Инвентаризация" или Документ.метаданные().имя="ОприходованиеТМЦ"  тогда
			движение.КодОперации=Перечисления.КодыОперацийОстатки.Оприходование;
		ИначеЕсли 
			документ.метаданные().имя="Перемещение" тогда
			движение.КодОперации=Перечисления.КодыОперацийОстатки.Перемещение;
		ИначеЕсли 
			документ.метаданные().имя="ПриходнаяНакладная" тогда
			движение.КодОперации=Перечисления.КодыОперацийОстатки.Закупка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	
	возврат истина	
КонецФункции


Функция КонтрольКоличестваСертификатов(Сертификат,склад,ДатаОстатков) экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	естьnull(СертификатныеОстаткиОстатки.КоличествоОстаток,0) КАК количество
	|ИЗ
	|	РегистрНакопления.СертификатныеОстатки.Остатки(
	|			&Дата2,
	|			Сертификат = &Сертификат
	|			И склад = &Склад) КАК СертификатныеОстаткиОстатки";
	//|ГДЕ
	//|	СертификатныеОстаткиОстатки.Склад = &Склад
	//|	И СертификатныеОстаткиОстатки.Сертификат = &Сертификат";
	запрос.УстановитьПараметр("Дата2",ДатаОстатков);
	запрос.УстановитьПараметр("Склад",склад);
	запрос.УстановитьПараметр("Сертификат",Сертификат);
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()>0 Тогда
		
		Возврат результат.получить(0).количество;
	иначе возврат 0
	КонецЕсли;
	
	
КонецФункции





функция получитьХПС(документ,форма) экспорт
	//Кухарь 09.01.18 начало
	//Чтобы не цепляло ХПС с пустыми основаниями
	попытка
		если документ.ссылка.склад=Справочники.Склады.ПустаяСсылка() тогда
			Возврат Неопределено;
		КонецЕсли;
	Исключение
	КонецПопытки;
	//Кухарь 09.01.18 конец
	
	
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	ХранилищеПодарочныхСертификатов.Ссылка КАК ссылка
	|ИЗ
	|	Документ.ХранилищеПодарочныхСертификатов КАК ХранилищеПодарочныхСертификатов
	|ГДЕ
	|	ХранилищеПодарочныхСертификатов.ДокОбъект = &ДокОбъект
	|	И ХранилищеПодарочныхСертификатов.ПометкаУдаления = ЛОЖЬ" ;
	запрос.УстановитьПараметр("ДокОбъект",документ.ссылка);
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()>0 тогда
		ХПС=результат.Получить(0).ссылка.получитьобъект();
		возврат ХПС;
	ИначеЕсли форма<>Неопределено тогда
		ХПС=документы.ХранилищеПодарочныхСертификатов.СоздатьДокумент();
		хпс.Сертификаты.Загрузить(форма.сертификаты);
		хпс.ДокОбъект=документ.ссылка;
		хпс.Дата=документ.дата;
		если хпс.сертификаты.количество()>0 тогда
			хпс.Записать();
		КонецЕсли;
		возврат ХПС;
	иначе Возврат Неопределено;
	КонецЕсли;
	
КонецФункции



//кухарь 23.12.13 начало
//оптимизация контроля сертификатных остатков

Функция КонтрольКоличестваСертификатовСписком(СписокСертификатов,склад,ДатаОстатков) экспорт
	//кухарь 09.01.13 начало
	если СписокСертификатов.количество()= 0 тогда
		Возврат Неопределено
	КонецЕсли;
	//кухарь 09.01.13 конец
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЕСТЬNULL(СертификатныеОстаткиОстатки.КоличествоОстаток, 0) КАК количество,
	//крохин начало 02.10.2014
	|	СертификатныеОстаткиОстатки.Сертификат.Ссылка как СертификатСсылка,
	//крохин конец 02.10.2014
	|	СертификатныеОстаткиОстатки.Сертификат.КодСертификата как Сертификат
	|ИЗ
	|	РегистрНакопления.СертификатныеОстатки.Остатки(
	|			&Дата2,
	|			Сертификат В (&СписокСертификатов)
	|				И склад = &Склад) КАК СертификатныеОстаткиОстатки";
	//|ГДЕ
	//|	СертификатныеОстаткиОстатки.Склад = &Склад
	//|	И СертификатныеОстаткиОстатки.Сертификат = &Сертификат";
	запрос.УстановитьПараметр("Дата2",ДатаОстатков);
	запрос.УстановитьПараметр("Склад",склад);
	//кухарь 20.01.14 начало
	//запрос.УстановитьПараметр("Сертификат",СписокСертификатов);	
	запрос.УстановитьПараметр("СписокСертификатов",СписокСертификатов);
	//кухарь 20.01.14 конец	
	результат=запрос.Выполнить().Выгрузить();
	Возврат результат;	
КонецФункции

//кухарь 23.12.13 конец

//крохин начало 20.01.2017
Функция ПогаситьСертификатыПриВозврате(Документ) Экспорт 
	ХПС = УчетСертификатов.получитьХПС(Документ,Неопределено);
	Для Каждого СтрокаТЧ ИЗ ХПС.Сертификаты Цикл
	СертификатОбъект = СтрокаТЧ.Сертификат.ПолучитьОбъект();
	СертификатОбъект.ДатаПогашения = Документ.дата;
	СертификатОбъект.Использован = Истина;
	СертификатОбъект.НомерЧекаПогашения = Документ.номер;
	СертификатОбъект.ПодразделениеПредъявления = Документ.подразделение;
	СертификатОбъект.Код = "R"+Прав(СертификатОбъект.Код,12);
	СертификатОбъект.Комментарий = "Сертификат был возвращен";
	СертификатОбъект.Записать();
	КонецЦикла;
КонецФункции
//крохин конец 20.01.2017
